#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-sa-dbaac-portal"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/b9e350a0-e179-4a8f-9a9e-338e1945a1f5]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-groups"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/f8a39a7c-a517-4ca7-b5c6-07a5230c99f4]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/a026de99-0044-4efb-a859-eb3d058802c2]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-org"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/bf47707a-33ee-464c-81f5-6d059fbd7a89]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-emcod"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/d891f427-9857-47b2-8c30-cf918d7bd359]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-licence-status"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/94dfdda1-883d-4ef0-b8ed-1f20caf185f9]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-metrics"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/640acddb-e3ca-4cc5-b4bd-71235651664c]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-all-groups"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/6d5475fd-ba57-44cc-b43f-4572bb02d35c]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-maid"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/34b4b945-291f-45f5-b8f3-a5b13abb33be]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-own-groups"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/5f395c6a-b50a-4cef-aba5-e7d3054f52fb]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-hcimweb_hd2"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/f7449ea7-0337-4a2f-8165-c496961fb276]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-sa-hibc-service-bc-portal"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/2d7d8d97-c2ac-4cd5-8a85-24b2ca72b38a]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-sa-sfdc"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/a4424091-6664-4e4e-b09c-e43b265c4c00]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-pho-rsc"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/7536153d-9d4f-4d3a-a4f1-d3f33791c932]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-hem"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/8120d2a4-ade7-4fcc-bf96-6be82239c26c]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-mspdirect-service"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/ad47580c-3550-4ec6-8220-b807e972e00a]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-pidp-service"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/a94a4b49-741b-4b5e-8284-197972276bbf]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-events"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/c653939f-3be6-4046-b42b-4a8f16ec956b]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-plr"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/b0102b5f-6f40-4331-b8e0-a6a09315b43a]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-dmft-webappp"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/c95b5611-59dd-4ea3-972d-1396eca7655c]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/338086cc-9ae9-41c7-a5bd-554b09e950c4]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-prp-service"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/02132234-a0f5-4820-ad3f-3c2d29d721b9]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/create-user"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/3a867741-6f02-4c4a-8771-bf356330b2fd]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-user-roles"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/203e5a10-f5b3-49d5-90c8-78b8f8a58f01]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-user-details"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/9f73ca65-3aa2-4ff1-9121-f90c72c89735]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-bcer-cp"]: Refreshing state... [id=ISB/client/628f6a63-ba9b-4822-b8a5-309be49e7dfc/scope-mappings/a0eacca0-8b5b-421d-b6a5-25f208a91484/fcf44872-3432-46aa-ad97-355ee60fe45b]
module.COMMON_SSO_DEV.module.ISB.module.DMFT-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=ISB/client/fb2247ae-8581-4058-8d8b-2e66769a30e9/scope-mappings/8defff03-3722-49c0-b7de-fb851ced02d9/a0b9a605-0932-45d1-9483-4d8bcde6bf95]
module.COMMON_SSO_DEV.module.ISB.module.DMFT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=22acb373-07cc-4f52-aa2f-d585cd079ced/a0b9a605-0932-45d1-9483-4d8bcde6bf95]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=ISB/client/1ffadba3-f8e2-46cf-9bb1-acfac68739ed/scope-mappings/8defff03-3722-49c0-b7de-fb851ced02d9/b8093188-cefb-4261-bffa-1f87caf7b780]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=ISB/client/1ffadba3-f8e2-46cf-9bb1-acfac68739ed/scope-mappings/8defff03-3722-49c0-b7de-fb851ced02d9/49408411-1bdb-4a44-aa43-2b2fef739b1c]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=ISB/client/1ffadba3-f8e2-46cf-9bb1-acfac68739ed/scope-mappings/8defff03-3722-49c0-b7de-fb851ced02d9/cb4bb418-4b7a-4ae6-93aa-440c10ca7c5e]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=ISB/client/1ffadba3-f8e2-46cf-9bb1-acfac68739ed/scope-mappings/d0f77a2f-634f-40a6-bb08-48c695a7067f/165fc2fb-009c-4ab6-9352-97ad183372ef]
module.COMMON_SSO_DEV.module.ISB.module.MANAGE-USERS.keycloak_role.REALM_ROLE: Refreshing state... [id=d517767e-8d83-4477-b91c-4f8a089044f2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.COMMON_SSO_DEV.module.ISB.module.TOMCAT-CLIENT.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_token_lifespan                     = (known after apply)
      + access_type                               = "BEARER-ONLY"
      + admin_url                                 = (known after apply)
      + backchannel_logout_session_required       = true
      + base_url                                  = (known after apply)
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "jam-lea-api"
      + client_offline_session_idle_timeout       = (known after apply)
      + client_offline_session_max_lifespan       = (known after apply)
      + client_secret                             = (sensitive value)
      + client_session_idle_timeout               = (known after apply)
      + client_session_max_lifespan               = (known after apply)
      + consent_required                          = false
      + consent_screen_text                       = (known after apply)
      + description                               = "Law Enforcement Availability API Client"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = (known after apply)
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = (known after apply)
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + import                                    = false
      + name                                      = "jam-lea-api"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "ISB"
      + resource_server_id                        = (known after apply)
      + root_url                                  = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_post_logout_redirect_uris           = (known after apply)
      + valid_redirect_uris                       = (known after apply)
      + web_origins                               = (known after apply)
    }

  # module.COMMON_SSO_DEV.module.ISB.module.azure.keycloak_oidc_identity_provider.this will be updated in-place
  ~ resource "keycloak_oidc_identity_provider" "this" {
      ~ extra_config                            = {
          + "forwardParameters" = ""
          + "tooltip"           = ""
            # (1 unchanged element hidden)
        }
        id                                      = "azure"
        # (25 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sookeke, Action: `pull_request`*